In [18]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt 

# load the dataset 
df = pd.read_csv('dataset.csv')
df.head()

   Unnamed: 0                              Name    Location  Year  ...   Engine      Power Seats  Price
0           0            Maruti Wagon R LXI CNG      Mumbai  2010  ...   998 CC  58.16 bhp   5.0   1.75
1           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015  ...  1582 CC  126.2 bhp   5.0  12.50
2           2                      Honda Jazz V     Chennai  2011  ...  1199 CC   88.7 bhp   5.0   4.50
3           3                 Maruti Ertiga VDI     Chennai  2012  ...  1248 CC  88.76 bhp   7.0   6.00
4           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013  ...  1968 CC  140.8 bhp   5.0  17.74

[5 rows x 13 columns]

In [2]:
# clean the data 

# dectect the missing values 
df.isnull().sum()

Unnamed: 0            0
Name                  0
Location              0
Year                  0
Kilometers_Driven     0
Fuel_Type             0
Transmission          0
Owner_Type            0
Mileage               2
Engine               36
Power                36
Seats                42
Price                 0
dtype: int64

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         6019 non-null   int64
 1   Name               6019 non-null   object
 2   Location           6019 non-null   object
 3   Year               6019 non-null   int64
 4   Kilometers_Driven  6019 non-null   int64
 5   Fuel_Type          6019 non-null   object
 6   Transmission       6019 non-null   object
 7   Owner_Type         6019 non-null   object
 8   Mileage            6017 non-null   object
 9   Engine             5983 non-null   object
 10  Power              5983 non-null   object
 11  Seats              6019 non-null   float64
 12  Price              6019 non-null   float64
dtypes: float64(2), int64(3), object(8)
memory usage: 611.4+ KB

In [ ]:
# fill the missing value in seat column 
df['Seats'].fillna(df['Seats'].mean() ,inplace = True)

# clean the missing value in Power column
df['Power'] = df['Power'].astype(str)

df['Power'] = df['Power'].str.replace('bhp', '', regex=False).replace(['null', 'null ', 'Null', ''], np.nan)

# Convert the column to numeric
df['Power'] = pd.to_numeric(df['Power'], errors='coerce')

# Fill missing values with mean
df['Power'].fillna(df['Power'].mean(), inplace=True)


# clean the missing value in Engine
df['Engine'] = df['Engine'].str.replace('CC','').astype(float)
# fiil with the mean value 
df['Engine'].fillna(df['Engine'].mean() , inplace = True)

In [52]:
df['Mileage'] = df['Mileage'].astype(str)
df['Mileage'] = df['Mileage'].str.replace(r'kmpl|km/kg','' , regex=True).replace(['null', 'NaN', 'nan', '', ' '], np.nan)
df['Mileage'] = pd.to_numeric(df['Mileage'] , errors='coerce')
df['Mileage'].fillna(df['Mileage'].mean(), inplace = True)
df.isnull().sum()

C:\Users\yes\AppData\Local\Temp\ipykernel_18792\2729842490.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Mileage'].fillna(df['Mileage'].mean(), inplace = True)

Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
Price                0
dtype: int64

In [54]:
# fix the outliers 
df.describe()

        Unnamed: 0         Year  Kilometers_Driven      Mileage       Engine        Power        Seats        Price
count  6019.000000  6019.000000       6.019000e+03  6019.000000  6019.000000  6019.000000  6019.000000  6019.000000
mean   3009.000000  2013.358199       5.873838e+04    18.134961  1621.276450   113.253050     5.278735     9.479468
std    1737.679967     3.269742       9.126884e+04     4.581528   599.553865    53.231019     0.806012    11.187917
min       0.000000  1998.000000       1.710000e+02     0.000000    72.000000    34.200000     0.000000     0.440000
25%    1504.500000  2011.000000       3.400000e+04    15.170000  1198.000000    78.000000     5.000000     3.500000
50%    3009.000000  2014.000000       5.300000e+04    18.150000  1493.000000    98.600000     5.000000     5.640000
75%    4513.500000  2016.000000       7.300000e+04    21.100000  1969.000000   138.030000     5.000000     9.950000
max    6018.000000  2019.000000       6.500000e+06    33.540000  5998.000000   560.000000    10.000000   160.000000